{
    "model_type": "bpe",
    "model_kwargs": {
        "unk_token": "<unk>",
        "byte_fallback": true
    },
    "trainer_kwargs": {
        "vocab_size": 32768,
        "limit_alphabet": 512,
        "special_tokens": [
            "<unk>",
            "<s>",
            "</s>",
            "<pad>",
            "<eod>",
            "<placeholder_tok_0>",
            "<placeholder_tok_1>",
            "<placeholder_tok_2>",
            "<placeholder_tok_3>",
            "<placeholder_tok_4>",
            "<placeholder_tok_5>",
            "<placeholder_tok_6>",
            "<placeholder_tok_7>",
            "<placeholder_tok_8>",
            "<placeholder_tok_9>",
            "<placeholder_tok_10>",
            "<placeholder_tok_11>",
            "<placeholder_tok_12>",
            "<placeholder_tok_13>",
            "<placeholder_tok_14>",
            "<placeholder_tok_15>",
            "<placeholder_tok_16>",
            "<placeholder_tok_17>",
            "<placeholder_tok_18>",
            "<placeholder_tok_19>",
            "<placeholder_tok_20>",
            "<placeholder_tok_21>",
            "<placeholder_tok_22>",
            "<placeholder_tok_23>",
            "<placeholder_tok_24>",
            "<placeholder_tok_25>",
            "<placeholder_tok_26>",
            "<placeholder_tok_27>",
            "<placeholder_tok_28>",
            "<placeholder_tok_29>",
            "<placeholder_tok_30>",
            "<placeholder_tok_31>",
            "<placeholder_tok_32>",
            "<placeholder_tok_33>",
            "<placeholder_tok_34>",
            "<placeholder_tok_35>",
            "<placeholder_tok_36>",
            "<placeholder_tok_37>",
            "<placeholder_tok_38>",
            "<placeholder_tok_39>",
            "<placeholder_tok_40>",
            "<placeholder_tok_41>",
            "<placeholder_tok_42>",
            "<placeholder_tok_43>",
            "<placeholder_tok_44>",
            "<placeholder_tok_45>",
            "<placeholder_tok_46>",
            "<placeholder_tok_47>",
            "<placeholder_tok_48>",
            "<placeholder_tok_49>",
            "<placeholder_tok_50>",
            "<placeholder_tok_51>",
            "<placeholder_tok_52>",
            "<placeholder_tok_53>",
            "<placeholder_tok_54>",
            "<placeholder_tok_55>",
            "<placeholder_tok_56>",
            "<placeholder_tok_57>",
            "<placeholder_tok_58>",
            "<placeholder_tok_59>",
            "<placeholder_tok_60>",
            "<placeholder_tok_61>",
            "<placeholder_tok_62>",
            "<placeholder_tok_63>",
            "<placeholder_tok_64>",
            "<placeholder_tok_65>",
            "<placeholder_tok_66>",
            "<placeholder_tok_67>",
            "<placeholder_tok_68>",
            "<placeholder_tok_69>",
            "<placeholder_tok_70>",
            "<placeholder_tok_71>",
            "<placeholder_tok_72>",
            "<placeholder_tok_73>",
            "<placeholder_tok_74>",
            "<placeholder_tok_75>",
            "<placeholder_tok_76>",
            "<placeholder_tok_77>",
            "<placeholder_tok_78>",
            "<placeholder_tok_79>",
            "<placeholder_tok_80>",
            "<placeholder_tok_81>",
            "<placeholder_tok_82>",
            "<placeholder_tok_83>",
            "<placeholder_tok_84>",
            "<placeholder_tok_85>",
            "<placeholder_tok_86>",
            "<placeholder_tok_87>",
            "<placeholder_tok_88>",
            "<placeholder_tok_89>",
            "<placeholder_tok_90>",
            "<placeholder_tok_91>",
            "<placeholder_tok_92>",
            "<placeholder_tok_93>",
            "<placeholder_tok_94>",
            "<placeholder_tok_95>",
            "<placeholder_tok_96>",
            "<placeholder_tok_97>",
            "<placeholder_tok_98>",
            "<placeholder_tok_99>",
            "<placeholder_tok_100>",
            "<placeholder_tok_101>",
            "<placeholder_tok_102>",
            "<placeholder_tok_103>",
            "<placeholder_tok_104>",
            "<placeholder_tok_105>",
            "<placeholder_tok_106>",
            "<placeholder_tok_107>",
            "<placeholder_tok_108>",
            "<placeholder_tok_109>",
            "<placeholder_tok_110>",
            "<placeholder_tok_111>",
            "<placeholder_tok_112>",
            "<placeholder_tok_113>",
            "<placeholder_tok_114>",
            "<placeholder_tok_115>",
            "<placeholder_tok_116>",
            "<placeholder_tok_117>",
            "<placeholder_tok_118>",
            "<placeholder_tok_119>",
            "<placeholder_tok_120>",
            "<placeholder_tok_121>",
            "<placeholder_tok_122>",
            "<placeholder_tok_123>",
            "<placeholder_tok_124>",
            "<placeholder_tok_125>",
            "<placeholder_tok_126>",
            "<placeholder_tok_127>",
            "<placeholder_tok_128>",
            "<placeholder_tok_129>",
            "<placeholder_tok_130>",
            "<placeholder_tok_131>",
            "<placeholder_tok_132>",
            "<placeholder_tok_133>",
            "<placeholder_tok_134>",
            "<placeholder_tok_135>",
            "<placeholder_tok_136>",
            "<placeholder_tok_137>",
            "<placeholder_tok_138>",
            "<placeholder_tok_139>",
            "<placeholder_tok_140>",
            "<placeholder_tok_141>",
            "<placeholder_tok_142>",
            "<placeholder_tok_143>",
            "<placeholder_tok_144>",
            "<placeholder_tok_145>",
            "<placeholder_tok_146>",
            "<placeholder_tok_147>",
            "<placeholder_tok_148>",
            "<placeholder_tok_149>",
            "<placeholder_tok_150>",
            "<placeholder_tok_151>",
            "<placeholder_tok_152>",
            "<placeholder_tok_153>",
            "<placeholder_tok_154>",
            "<placeholder_tok_155>",
            "<placeholder_tok_156>",
            "<placeholder_tok_157>",
            "<placeholder_tok_158>",
            "<placeholder_tok_159>",
            "<placeholder_tok_160>",
            "<placeholder_tok_161>",
            "<placeholder_tok_162>",
            "<placeholder_tok_163>",
            "<placeholder_tok_164>",
            "<placeholder_tok_165>",
            "<placeholder_tok_166>",
            "<placeholder_tok_167>",
            "<placeholder_tok_168>",
            "<placeholder_tok_169>",
            "<placeholder_tok_170>",
            "<placeholder_tok_171>",
            "<placeholder_tok_172>",
            "<placeholder_tok_173>",
            "<placeholder_tok_174>",
            "<placeholder_tok_175>",
            "<placeholder_tok_176>",
            "<placeholder_tok_177>",
            "<placeholder_tok_178>",
            "<placeholder_tok_179>",
            "<placeholder_tok_180>",
            "<placeholder_tok_181>",
            "<placeholder_tok_182>",
            "<placeholder_tok_183>",
            "<placeholder_tok_184>",
            "<placeholder_tok_185>",
            "<placeholder_tok_186>",
            "<placeholder_tok_187>",
            "<placeholder_tok_188>",
            "<placeholder_tok_189>",
            "<placeholder_tok_190>",
            "<placeholder_tok_191>",
            "<placeholder_tok_192>",
            "<placeholder_tok_193>",
            "<placeholder_tok_194>",
            "<placeholder_tok_195>",
            "<placeholder_tok_196>",
            "<placeholder_tok_197>",
            "<placeholder_tok_198>",
            "<placeholder_tok_199>",
            "<placeholder_tok_200>",
            "<placeholder_tok_201>",
            "<placeholder_tok_202>",
            "<placeholder_tok_203>",
            "<placeholder_tok_204>",
            "<placeholder_tok_205>",
            "<placeholder_tok_206>",
            "<placeholder_tok_207>",
            "<placeholder_tok_208>",
            "<placeholder_tok_209>",
            "<placeholder_tok_210>",
            "<placeholder_tok_211>",
            "<placeholder_tok_212>",
            "<placeholder_tok_213>",
            "<placeholder_tok_214>",
            "<placeholder_tok_215>",
            "<placeholder_tok_216>",
            "<placeholder_tok_217>",
            "<placeholder_tok_218>",
            "<placeholder_tok_219>",
            "<placeholder_tok_220>",
            "<placeholder_tok_221>",
            "<placeholder_tok_222>",
            "<placeholder_tok_223>",
            "<placeholder_tok_224>",
            "<placeholder_tok_225>",
            "<placeholder_tok_226>",
            "<placeholder_tok_227>",
            "<placeholder_tok_228>",
            "<placeholder_tok_229>",
            "<placeholder_tok_230>",
            "<placeholder_tok_231>",
            "<placeholder_tok_232>",
            "<placeholder_tok_233>",
            "<placeholder_tok_234>",
            "<placeholder_tok_235>",
            "<placeholder_tok_236>",
            "<placeholder_tok_237>",
            "<placeholder_tok_238>",
            "<placeholder_tok_239>",
            "<placeholder_tok_240>",
            "<placeholder_tok_241>",
            "<placeholder_tok_242>",
            "<placeholder_tok_243>",
            "<placeholder_tok_244>",
            "<placeholder_tok_245>",
            "<placeholder_tok_246>",
            "<placeholder_tok_247>",
            "<placeholder_tok_248>",
            "<placeholder_tok_249>",
            "<placeholder_tok_250>",
            "<placeholder_tok_251>",
            "<placeholder_tok_252>",
            "<placeholder_tok_253>",
            "<placeholder_tok_254>",
            "<placeholder_tok_255>",
            "<0x00>",
            "<0x01>",
            "<0x02>",
            "<0x03>",
            "<0x04>",
            "<0x05>",
            "<0x06>",
            "<0x07>",
            "<0x08>",
            "<0x09>",
            "<0x0A>",
            "<0x0B>",
            "<0x0C>",
            "<0x0D>",
            "<0x0E>",
            "<0x0F>",
            "<0x10>",
            "<0x11>",
            "<0x12>",
            "<0x13>",
            "<0x14>",
            "<0x15>",
            "<0x16>",
            "<0x17>",
            "<0x18>",
            "<0x19>",
            "<0x1A>",
            "<0x1B>",
            "<0x1C>",
            "<0x1D>",
            "<0x1E>",
            "<0x1F>",
            "<0x20>",
            "<0x21>",
            "<0x22>",
            "<0x23>",
            "<0x24>",
            "<0x25>",
            "<0x26>",
            "<0x27>",
            "<0x28>",
            "<0x29>",
            "<0x2A>",
            "<0x2B>",
            "<0x2C>",
            "<0x2D>",
            "<0x2E>",
            "<0x2F>",
            "<0x30>",
            "<0x31>",
            "<0x32>",
            "<0x33>",
            "<0x34>",
            "<0x35>",
            "<0x36>",
            "<0x37>",
            "<0x38>",
            "<0x39>",
            "<0x3A>",
            "<0x3B>",
            "<0x3C>",
            "<0x3D>",
            "<0x3E>",
            "<0x3F>",
            "<0x40>",
            "<0x41>",
            "<0x42>",
            "<0x43>",
            "<0x44>",
            "<0x45>",
            "<0x46>",
            "<0x47>",
            "<0x48>",
            "<0x49>",
            "<0x4A>",
            "<0x4B>",
            "<0x4C>",
            "<0x4D>",
            "<0x4E>",
            "<0x4F>",
            "<0x50>",
            "<0x51>",
            "<0x52>",
            "<0x53>",
            "<0x54>",
            "<0x55>",
            "<0x56>",
            "<0x57>",
            "<0x58>",
            "<0x59>",
            "<0x5A>",
            "<0x5B>",
            "<0x5C>",
            "<0x5D>",
            "<0x5E>",
            "<0x5F>",
            "<0x60>",
            "<0x61>",
            "<0x62>",
            "<0x63>",
            "<0x64>",
            "<0x65>",
            "<0x66>",
            "<0x67>",
            "<0x68>",
            "<0x69>",
            "<0x6A>",
            "<0x6B>",
            "<0x6C>",
            "<0x6D>",
            "<0x6E>",
            "<0x6F>",
            "<0x70>",
            "<0x71>",
            "<0x72>",
            "<0x73>",
            "<0x74>",
            "<0x75>",
            "<0x76>",
            "<0x77>",
            "<0x78>",
            "<0x79>",
            "<0x7A>",
            "<0x7B>",
            "<0x7C>",
            "<0x7D>",
            "<0x7E>",
            "<0x7F>",
            "<0x80>",
            "<0x81>",
            "<0x82>",
            "<0x83>",
            "<0x84>",
            "<0x85>",
            "<0x86>",
            "<0x87>",
            "<0x88>",
            "<0x89>",
            "<0x8A>",
            "<0x8B>",
            "<0x8C>",
            "<0x8D>",
            "<0x8E>",
            "<0x8F>",
            "<0x90>",
            "<0x91>",
            "<0x92>",
            "<0x93>",
            "<0x94>",
            "<0x95>",
            "<0x96>",
            "<0x97>",
            "<0x98>",
            "<0x99>",
            "<0x9A>",
            "<0x9B>",
            "<0x9C>",
            "<0x9D>",
            "<0x9E>",
            "<0x9F>",
            "<0xA0>",
            "<0xA1>",
            "<0xA2>",
            "<0xA3>",
            "<0xA4>",
            "<0xA5>",
            "<0xA6>",
            "<0xA7>",
            "<0xA8>",
            "<0xA9>",
            "<0xAA>",
            "<0xAB>",
            "<0xAC>",
            "<0xAD>",
            "<0xAE>",
            "<0xAF>",
            "<0xB0>",
            "<0xB1>",
            "<0xB2>",
            "<0xB3>",
            "<0xB4>",
            "<0xB5>",
            "<0xB6>",
            "<0xB7>",
            "<0xB8>",
            "<0xB9>",
            "<0xBA>",
            "<0xBB>",
            "<0xBC>",
            "<0xBD>",
            "<0xBE>",
            "<0xBF>",
            "<0xC0>",
            "<0xC1>",
            "<0xC2>",
            "<0xC3>",
            "<0xC4>",
            "<0xC5>",
            "<0xC6>",
            "<0xC7>",
            "<0xC8>",
            "<0xC9>",
            "<0xCA>",
            "<0xCB>",
            "<0xCC>",
            "<0xCD>",
            "<0xCE>",
            "<0xCF>",
            "<0xD0>",
            "<0xD1>",
            "<0xD2>",
            "<0xD3>",
            "<0xD4>",
            "<0xD5>",
            "<0xD6>",
            "<0xD7>",
            "<0xD8>",
            "<0xD9>",
            "<0xDA>",
            "<0xDB>",
            "<0xDC>",
            "<0xDD>",
            "<0xDE>",
            "<0xDF>",
            "<0xE0>",
            "<0xE1>",
            "<0xE2>",
            "<0xE3>",
            "<0xE4>",
            "<0xE5>",
            "<0xE6>",
            "<0xE7>",
            "<0xE8>",
            "<0xE9>",
            "<0xEA>",
            "<0xEB>",
            "<0xEC>",
            "<0xED>",
            "<0xEE>",
            "<0xEF>",
            "<0xF0>",
            "<0xF1>",
            "<0xF2>",
            "<0xF3>",
            "<0xF4>",
            "<0xF5>",
            "<0xF6>",
            "<0xF7>",
            "<0xF8>",
            "<0xF9>",
            "<0xFA>",
            "<0xFB>",
            "<0xFC>",
            "<0xFD>",
            "<0xFE>",
            "<0xFF>"
        ]
    },
    "use_nfkc_normalizer": true,
    "use_lowercase_normalizer": false,
    "use_strip_accents_normalizer": false,
    "use_byte_level_pre_tokenizer": false,
    "datasets_dir": "/p/scratch/opengptx-elm/data/datasources_opgptx/data_quality_experiments_datasets/ablations_studies/monolingual_en/70B_10//data",
    "save_dir": "/p/scratch/opengptx-elm/data/datasources_opgptx/data_quality_experiments_datasets/ablations_studies/monolingual_en/70B_10/tokenizer_training/bpe/hf/32768_10",
    "text_key": "text",
    "cache_dir": "/p/scratch/opengptx-elm/data/datasources_opgptx/data_quality_experiments_datasets/ablations_studies/monolingual_en/70B_10//tokenizer_training/bpe/hf/32768_10/cache",
    "library": "huggingface"
}